### Practice 0720

#### Grouping Rows by Time

In [1]:
import pandas as pd
import numpy as np
# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')

In [2]:
df=pd.DataFrame(index=time_index)

In [3]:
df['Sale Amount'] = np.random.randint(1, 10, 100000)

In [4]:
# group rows by week, aggregate by sum (resample)
df.resample('W').sum()

            Sale Amount
2017-06-11        86579
2017-06-18       100867
2017-06-25       101035
2017-07-02       100851
2017-07-09       100836
2017-07-16        10255

In [5]:
df.head(3)

                     Sale Amount
2017-06-06 00:00:00            3
2017-06-06 00:00:30            9
2017-06-06 00:01:00            6

In [6]:
df.resample('2W').mean()

            Sale Amount
2017-06-11     5.010359
2017-06-25     5.007490
2017-07-09     5.002158
2017-07-23     4.930288

In [7]:
df.resample('M').count()

            Sale Amount
2017-06-30        72000
2017-07-31        28000

In [8]:
# default resample returns the 'right' edge of the range, can change
# this with the 'label' parameter:
df.resample('M', label='left').count()

            Sale Amount
2017-05-31        72000
2017-06-30        28000

#### Looping Over a Column

In [9]:
# return to titanic db
url = 'https://raw.githubusercontent.com/chrisalbon/sim_data/master/titanic.csv'

df = pd.read_csv(url)

# print first two names uppercased

for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [10]:
# for loops
# print first two names uppercased
for name in df['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [11]:
# list comprehensions
def uppercase(x):
    return x.upper()

In [12]:
# apply function
df['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [13]:
df.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [14]:
# Concatenating dfs
# Create DataFrame
data_a = {'id': ['1', '2', '3'],
          'first': ['Alex', 'Amy', 'Allen'],
          'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])
data_b = {'id': ['4', '5', '6'],
          'first': ['Billy', 'Brian', 'Bran'],
          'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])

In [15]:
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [16]:
# concatenate dataframes by column
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [17]:
# alternatively can use append to add a row to a df
# Create row
row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])

In [18]:
# append row
dataframe_a.append(row, ignore_index=True)

/var/folders/pd/dk0dsnvs72ng9hv5mkv2d0980000gn/T/ipykernel_3052/3013920535.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

In [19]:
# using the input command
# print a welcome message to user
print('\n\n\n~~~ Welcome to your annual wage calculator! ~~~\n\n\n')

# user inputs the hourly wage they want to use to find annual salary
user_input = input("Input the hourly wage:\n")
print(int(user_input) * 40 * 52)

~~~ Welcome to your annual wage calculator! ~~~

Input the hourly wage:
 30

62400